УТ_для_edt/src/InformationRegisters/смартЛицензииПО/смартЛицензииПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартЛицензииПО</name>
  <comment>#Б-3180 смарт: Лопато 10.07.2025 //Лицензии IECHO. Отражение в учетной программе.</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТипЛицензии</name>
    <type>
      <types>EnumRef.смартТипыЛицензии</types>
    </type>
  </resources>
  <resources>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУстановкиПостояннойЛицензии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартТипыЛицензии/смартТипыЛицензии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартТипыЛицензии</name>
  <comment>#Б-3180 смарт: Лопато 10.07.2025 //Лицензии IECHO. Отражение в учетной программе.</comment>
  <enumValues>
    <name>Временная</name>
  </enumValues>
  <enumValues>
    <name>Постоянная</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/смартЛицензииПО/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ТаблицаЛицензий", Выгрузить(, "Период, Заявка, Номенклатура, Серия, ТипЛицензии"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаЛицензий.Период КАК Период,
	|	ТаблицаЛицензий.Заявка КАК Заявка,
	|	ТаблицаЛицензий.Номенклатура КАК Номенклатура,
	|	ТаблицаЛицензий.Серия КАК Серия,
	|	ТаблицаЛицензий.ТипЛицензии КАК ТипЛицензии
	|ПОМЕСТИТЬ ВТ_ТаблицаЛицензий
	|ИЗ
	|	&ТаблицаЛицензий КАК ТаблицаЛицензий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Период КАК Период,
	|	Заявка КАК Заявка,
	|	Номенклатура КАК Номенклатура,
	|	Серия КАК Серия,
	|	ТипЛицензии КАК ТипЛицензии
	|ПОМЕСТИТЬ смартЛицензииПО
	|ИЗ
	|	РегистрСведений.смартЛицензииПО КАК смартЛицензииПО
	|ГДЕ
	|   НЕ 
	|	(Период, Заявка, Номенклатура, Серия, ТипЛицензии)
	|	В(ВЫБРАТЬ 
	|		  ВТ_ТаблицаЛицензий.Период, 
	|		  ВТ_ТаблицаЛицензий.Заявка,
	|		  ВТ_ТаблицаЛицензий.Номенклатура,
	|		  ВТ_ТаблицаЛицензий.Серия,
	|		  ВТ_ТаблицаЛицензий.ТипЛицензии
	|	  ИЗ 
	|		  ВТ_ТаблицаЛицензий КАК ВТ_ТаблицаЛицензий) 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЛицензий.Заявка КАК Заявка,
	|	ВТ_ТаблицаЛицензий.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаЛицензий.Серия КАК Серия
	|ИЗ
	|	ВТ_ТаблицаЛицензий КАК ВТ_ТаблицаЛицензий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ смартЛицензииПО КАК смартЛицензииПО
	|		ПО (ВТ_ТаблицаЛицензий.Заявка = смартЛицензииПО.Заявка)
	|			И (ВТ_ТаблицаЛицензий.Номенклатура = смартЛицензииПО.Номенклатура)
	|			И (ВТ_ТаблицаЛицензий.Серия = смартЛицензииПО.Серия)
	|			И ВТ_ТаблицаЛицензий.ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.смартТипыЛицензии.Постоянная)
	|			И смартЛицензииПО.ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.смартТипыЛицензии.Постоянная)
	|;
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЛицензий.Заявка КАК Заявка,
	|	ВТ_ТаблицаЛицензий.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаЛицензий.Серия КАК Серия
	|ИЗ
	|	ВТ_ТаблицаЛицензий КАК ВТ_ТаблицаЛицензий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ смартЛицензииПО КАК смартЛицензииПО
	|		ПО (ВТ_ТаблицаЛицензий.Заявка = смартЛицензииПО.Заявка)
	|			И (ВТ_ТаблицаЛицензий.Номенклатура = смартЛицензииПО.Номенклатура)
	|			И (ВТ_ТаблицаЛицензий.Серия = смартЛицензииПО.Серия)
	|			И ВТ_ТаблицаЛицензий.ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.смартТипыЛицензии.Постоянная)
	|			И смартЛицензииПО.ТипЛицензии = ЗНАЧЕНИЕ(Перечисление.смартТипыЛицензии.Временная)
	|			И ВТ_ТаблицаЛицензий.Период < смартЛицензииПО.Период";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка1 = РезультатЗапроса[2].Выбрать();
	Выборка2 = РезультатЗапроса[3].Выбрать();
	
	Если Выборка1.Следующий() Тогда

		ОбщегоНазначения.СообщитьПользователю("Для заявки " + СокрЛП(Выборка1.Заявка) + Символы.ПС
											  + "для оборудования " + СокрЛП(Выборка1.Номенклатура) + Символы.ПС
		                                      + " серии " + СокрЛП(Выборка1.Серия) + Символы.ПС
											  + " уже введена постоянная лицензия!",
											  , , , Отказ);
		
	КонецЕсли;
		
	Если Выборка2.Следующий() Тогда

		ОбщегоНазначения.СообщитьПользователю("Для заявки " + СокрЛП(Выборка2.Заявка) + Символы.ПС
											  + "для оборудования " + СокрЛП(Выборка2.Номенклатура) + Символы.ПС
		                                      + " серии " + СокрЛП(Выборка2.Серия) + Символы.ПС
											  + " постоянная лицензия не может быть раньше временной!",
											  , , , Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
